#pragma once
#include <string>
#include <cstdlib>


std::string name[30] = { "Александр", "Матвей", "Михаил", "Ефим", "Дмитрий", "Георгий", "Иван", "Джон", "Артем", "Ден", "Максим", "Ларри", "Андрей", "Кларк", "Никита", "Боб", "Егор", "Блюрп", "Владимир", "Лев", "Ярослав", "Александра", "Сергей", "Василий", "Кирилл", "Блик", "Денис", "Даниил", "Тимофей", "Дамир" };
std::string patronymic[30] = { "Александрович", "Андреевич", "Алексеевич", "Борисович", "Васильевич", "Викторович", "Владимирович", "Геннадьевич", "Дмитриевич", "Евгеньевич", "Иванович", "Игоревич", "Кириллович", "Максимович", "Михайлович", "Николаевич", "Олегович", "Павлович", "Романович", "Сергеевич", "Станиславович", "Тимофеевич", "Федорович", "Юрьевич", "Ярославович", "Александровна", "Андреевна", "Алексеевна", "Борисовна", "Васильевна" };
std::string surnames[30] = { "Иванов", "Смирнов", "Кузнецов", "Попов", "Васильев", "Петров", "Соколов", "Михайлов", "Новиков", "Фёдоров", "Морозов", "Волков", "Алексеев", "Лебедев", "Семёнов", "Егоров", "Павлов", "Козлов", "Степанов", "Николаев", "Орлов", "Андреев", "Макаров", "Никитин", "Захаров", "Зайцев", "Соловьёв", "Борисов", "Яковлев", "Герасимов" };
std::string phones[30] = { "+79161234567", "+79252345678", "+79033456789", "+79684567890", "+79855678901", "+79156789012", "+79267890123", "+79058901234", "+79679012345", "+79870123456", "+79171235678", "+79272346789", "+79073457890", "+79664568901", "+79865679012", "+79186780123", "+79287891234", "+79088902345", "+79699013456", "+79890124567", "+79191236789", "+79292347890", "+79093458901", "+79654569012", "+79885670123", "+79146781234", "+79247892345", "+79048903456", "+79649014567", "+79840125678" };
std::string ID[30] = { "1234567", "2345678", "3456789", "4567890", "5678901", "6789012", "7890123", "8901234", "9012345", "0123456", "2345789", "3456890", "4567901", "5678012", "6789123", "7890234", "8901345", "9012456", "0123567", "1234678", "2345789", "3456890", "4567901", "5678012", "6789123", "7890234", "8901345", "9012456", "0123567", "1234678" };
std::string dates[30] = { "01.01.1998", "02.02.1999", "03.03.2000", "04.04.2001", "05.05.2002", "06.06.2003", "07.07.2004", "08.08.2005", "09.09.2006", "10.01.1999", "11.02.2000", "12.03.2001", "13.04.2002", "14.05.2003", "15.06.2004", "16.07.2005", "17.08.2006", "18.01.2000", "19.02.2001", "20.03.2002", "21.04.2003", "22.05.2004", "23.06.2005", "24.07.2006", "25.01.2001", "26.02.2002", "27.03.2003", "28.04.2004", "29.05.2005", "30.01.2002" };


int getRandomNumber() //Changed to CamelCase
{
    return rand() % 30;
}
std::string getRandomName() //Changed to CamelCase
{
    return (surnames[getRandomNumber()] + " " + name[getRandomNumber()] + " " + patronymic[getRandomNumber()]);
}
std::string getRandomID() //Changed to CamelCase
{
    return ID[getRandomNumber()];
}
std::string getRandomPhone()
{
    return phones[getRandomNumber()];
}
std::string getRandomDate()
{
    return dates[getRandomNumber()];
}

